# Q1. How do you load a CSV file into a Pandas DataFrame?

In [1]:
import pandas as pd # Importing panda library
df = pd.read_csv("sample_data.csv") # loading csv file into panda data frame
df # printing dataframe

        name                emailid  pin code sirname
0      lalan     rrrlalan@gmail.com    825103   kumar
1   shashank       shasha@gmail.com    152354  pandit
2      guddu          abc@gmail.com    123456   kumar
3  sudhanshu  sskumar9876@gmail.com    560085   kumar

# Q2. How do you check the data type of a column in a Pandas DataFrame?

In [2]:
type(df["name"]) #printing data type of a column

pandas.core.series.Series

# Q3. How do you select rows from a Pandas DataFrame based on a condition?

In [3]:
df[df["name"] == "lalan"]

    name             emailid  pin code sirname
0  lalan  rrrlalan@gmail.com    825103   kumar

# Q4. How do you rename columns in a Pandas DataFrame?

In [4]:
df.rename(columns={"name":"Name", "emailid":"Email_id"}, inplace=True)
df

        Name               Email_id  pin code sirname
0      lalan     rrrlalan@gmail.com    825103   kumar
1   shashank       shasha@gmail.com    152354  pandit
2      guddu          abc@gmail.com    123456   kumar
3  sudhanshu  sskumar9876@gmail.com    560085   kumar

In [5]:
df.columns = ["Name1", "Email1", "Pin1", "LastName1"]
df

       Name1                 Email1    Pin1 LastName1
0      lalan     rrrlalan@gmail.com  825103     kumar
1   shashank       shasha@gmail.com  152354    pandit
2      guddu          abc@gmail.com  123456     kumar
3  sudhanshu  sskumar9876@gmail.com  560085     kumar

# Q5. How do you drop columns in a Pandas DataFrame?

In [31]:
df.drop(["LastName1", "Pin1"], axis=1, inplace=True)
df

       Name1                 Email1
0      lalan     rrrlalan@gmail.com
1   shashank       shasha@gmail.com
2      guddu          abc@gmail.com
3  sudhanshu  sskumar9876@gmail.com

# Q6. How do you find the unique values in a column of a Pandas DataFrame?

In [6]:
df["Name1"].unique()

array(['lalan', 'shashank', 'guddu', 'sudhanshu'], dtype=object)

# Q7. How do you find the number of missing values in each column of a Pandas DataFrame?

In [7]:
df.isnull().sum()

Name1        0
Email1       0
Pin1         0
LastName1    0
dtype: int64

# Q8. How do you fill missing values in a Pandas DataFrame with a specific value?

In [81]:
df["Pin1"] = ''
print(df)
df.fillna(value="ValuetoBeFilled", inplace=True) #Finding missing value and replacig with "ValuetoBeFilled" for entire df
print(df)
df.replace("", "ValuetoBeFilled",inplace=True)
print("\n", df)
df["Pin1"] = ''
df["Pin1"].interpolate(method ='linear', limit_direction ='forward', inplace=True)
print("\n", df)
df = pd.read_csv("sample_data.csv")

         mass  diameter Pin1
earth       3         1
mars        4         2
jupiter     5         3
         mass  diameter Pin1
earth       3         1
mars        4         2
jupiter     5         3

          mass  diameter             Pin1
earth       3         1  ValuetoBeFilled
mars        4         2  ValuetoBeFilled
jupiter     5         3  ValuetoBeFilled

          mass  diameter Pin1
earth       3         1
mars        4         2
jupiter     5         3

# Q9. How do you concatenate two Pandas DataFrames?

In [82]:
df1 = df2 = df
df_new0 = pd.concat([df1, df2], axis=0)
print(df1,"\n\n", df2,"\n\n", df_new0)

        name                emailid  pin code sirname
0      lalan     rrrlalan@gmail.com    825103   kumar
1   shashank       shasha@gmail.com    152354  pandit
2      guddu          abc@gmail.com    123456   kumar
3  sudhanshu  sskumar9876@gmail.com    560085   kumar

         name                emailid  pin code sirname
0      lalan     rrrlalan@gmail.com    825103   kumar
1   shashank       shasha@gmail.com    152354  pandit
2      guddu          abc@gmail.com    123456   kumar
3  sudhanshu  sskumar9876@gmail.com    560085   kumar

         name                emailid  pin code sirname
0      lalan     rrrlalan@gmail.com    825103   kumar
1   shashank       shasha@gmail.com    152354  pandit
2      guddu          abc@gmail.com    123456   kumar
3  sudhanshu  sskumar9876@gmail.com    560085   kumar
0      lalan     rrrlalan@gmail.com    825103   kumar
1   shashank       shasha@gmail.com    152354  pandit
2      guddu          abc@gmail.com    123456   kumar
3  sudhanshu  sskumar9876@gmail.com    560085   kumar

In [83]:
df_new1 = pd.concat([df1, df2], axis=1)
print(df1,"\n\n", df2,"\n\n", df_new1)

        name                emailid  pin code sirname
0      lalan     rrrlalan@gmail.com    825103   kumar
1   shashank       shasha@gmail.com    152354  pandit
2      guddu          abc@gmail.com    123456   kumar
3  sudhanshu  sskumar9876@gmail.com    560085   kumar

         name                emailid  pin code sirname
0      lalan     rrrlalan@gmail.com    825103   kumar
1   shashank       shasha@gmail.com    152354  pandit
2      guddu          abc@gmail.com    123456   kumar
3  sudhanshu  sskumar9876@gmail.com    560085   kumar

         name                emailid  pin code sirname       name  \
0      lalan     rrrlalan@gmail.com    825103   kumar      lalan
1   shashank       shasha@gmail.com    152354  pandit   shashank
2      guddu          abc@gmail.com    123456   kumar      guddu
3  sudhanshu  sskumar9876@gmail.com    560085   kumar  sudhanshu

                 emailid  pin code sirname
0     rrrlalan@gmail.com    825103   kumar
1       shasha@gmail.com    152354  pandit
2          abc@gmail.com    123456   kumar
3  sskumar9876@gmail.com    560085   kumar

# Q10. How do you merge two Pandas DataFrames on a specific column?

In [84]:
df1 = pd.DataFrame({'Name':['Raju', 'Rani', 'Geeta', 'Sita', 'Sohit'],'Marks':[80, 90, 75, 88, 59]})
df2 = pd.DataFrame({'Name':['Raju', 'Divya', 'Geeta', 'Sita'],'Grade':['A', 'A', 'B', 'A'],'Rank':[3, 1, 4, 2 ],
                    'Gender':['Male', 'Female', 'Female', 'Female']})
dfm = df1.merge(df2, on = 'Name', how = 'left')
print(df1)
print(df2)
print(dfm)

    Name  Marks
0   Raju     80
1   Rani     90
2  Geeta     75
3   Sita     88
4  Sohit     59
    Name Grade  Rank  Gender
0   Raju     A     3    Male
1  Divya     A     1  Female
2  Geeta     B     4  Female
3   Sita     A     2  Female
    Name  Marks Grade  Rank  Gender
0   Raju     80     A   3.0    Male
1   Rani     90   NaN   NaN     NaN
2  Geeta     75     B   4.0  Female
3   Sita     88     A   2.0  Female
4  Sohit     59   NaN   NaN     NaN

# Q11. How do you group data in a Pandas DataFrame by a specific column and apply an aggregation function?

In [85]:
print(df)
df_new = df.groupby("sirname")
print()
print(df_new.first())
df_new = df.groupby("sirname")["pin code"].sum()
print()
print(df_new)

        name                emailid  pin code sirname
0      lalan     rrrlalan@gmail.com    825103   kumar
1   shashank       shasha@gmail.com    152354  pandit
2      guddu          abc@gmail.com    123456   kumar
3  sudhanshu  sskumar9876@gmail.com    560085   kumar

             name             emailid  pin code
sirname
kumar       lalan  rrrlalan@gmail.com    825103
pandit   shashank    shasha@gmail.com    152354

sirname
kumar     1508644
pandit     152354
Name: pin code, dtype: int64

# Q12. How do you pivot a Pandas DataFrame?

In [86]:
print(df)
df_p = df.pivot(index="sirname", columns="name", values="pin code")
print()
print(df_p)

        name                emailid  pin code sirname
0      lalan     rrrlalan@gmail.com    825103   kumar
1   shashank       shasha@gmail.com    152354  pandit
2      guddu          abc@gmail.com    123456   kumar
3  sudhanshu  sskumar9876@gmail.com    560085   kumar

name        guddu     lalan  shashank  sudhanshu
sirname
kumar    123456.0  825103.0       NaN   560085.0
pandit        NaN       NaN  152354.0        NaN

# Q13. How do you change the data type of a column in a Pandas DataFrame?

In [87]:
print(df.dtypes)
dfn = df.astype({"pin code":float})
print(dfn.dtypes) # Data type of "column "pin code" changed

name        object
emailid     object
pin code     int64
sirname     object
dtype: object
name         object
emailid      object
pin code    float64
sirname      object
dtype: object

# Q14. How do you sort a Pandas DataFrame by a specific column?

In [88]:
df.sort_values(by=['name'])

        name                emailid  pin code sirname
2      guddu          abc@gmail.com    123456   kumar
0      lalan     rrrlalan@gmail.com    825103   kumar
1   shashank       shasha@gmail.com    152354  pandit
3  sudhanshu  sskumar9876@gmail.com    560085   kumar

# Q15. How do you create a copy of a Pandas DataFrame?

In [89]:
res = df.copy(deep=True) #After changing the value of original df copied df values wont change
print(res)

        name                emailid  pin code sirname
0      lalan     rrrlalan@gmail.com    825103   kumar
1   shashank       shasha@gmail.com    152354  pandit
2      guddu          abc@gmail.com    123456   kumar
3  sudhanshu  sskumar9876@gmail.com    560085   kumar

# Q16. How do you filter rows of a Pandas DataFrame by multiple conditions?

In [109]:
print(df, "\n\n")
print(df[df["name"] == "lalan"])
print("\n\n")
print(df[(df["name"] == "lalan") & (df["sirname"] == "kumar")])
print("\n\n")
print(df[df.eval("(name == 'lalan') & (sirname == 'kumar')")])
print("\n\n")
print(df.query("(name == 'lalan') & (sirname == 'kumar')"))

# We can also use df.where() and df.loc() function

        name                emailid  pin code sirname
0      lalan     rrrlalan@gmail.com    825103   kumar
1   shashank       shasha@gmail.com    152354  pandit
2      guddu          abc@gmail.com    123456   kumar
3  sudhanshu  sskumar9876@gmail.com    560085   kumar


    name             emailid  pin code sirname
0  lalan  rrrlalan@gmail.com    825103   kumar



    name             emailid  pin code sirname
0  lalan  rrrlalan@gmail.com    825103   kumar



    name             emailid  pin code sirname
0  lalan  rrrlalan@gmail.com    825103   kumar



    name             emailid  pin code sirname
0  lalan  rrrlalan@gmail.com    825103   kumar

# Q17. How do you calculate the mean of a column in a Pandas DataFrame?

In [111]:
df["pin code"].mean()

415249.5

# Q18. How do you calculate the standard deviation of a column in a Pandas DataFrame?

In [112]:
df["pin code"].std()

338237.9360179261

# Q19. How do you calculate the correlation between two columns in a Pandas DataFrame?

In [126]:
df["pin2"] = [1.2, 0, -0.4, -2.5]
print(df)
df["pin code"].corr(df["pin2"])

        name                emailid  pin code sirname  pin2
0      lalan     rrrlalan@gmail.com    825103   kumar   1.2
1   shashank       shasha@gmail.com    152354  pandit   0.0
2      guddu          abc@gmail.com    123456   kumar  -0.4
3  sudhanshu  sskumar9876@gmail.com    560085   kumar  -2.5

0.15757317609609942

# Q20. How do you select specific columns in a DataFrame using their labels?

In [141]:
print(df[["emailid", "sirname"]], "\n\n")
print(df[df.columns.difference(['emailid', 'sirname'])]) #gives all the column except mentioned

                 emailid sirname
0     rrrlalan@gmail.com   kumar
1       shasha@gmail.com  pandit
2          abc@gmail.com   kumar
3  sskumar9876@gmail.com   kumar


        name  pin code  pin2
0      lalan    825103   1.2
1   shashank    152354   0.0
2      guddu    123456  -0.4
3  sudhanshu    560085  -2.5


# Q21. How do you select specific rows in a DataFrame using their indexes?

In [134]:
df.iloc[1::2]

        name                emailid  pin code sirname  pin2
1   shashank       shasha@gmail.com    152354  pandit   0.0
3  sudhanshu  sskumar9876@gmail.com    560085   kumar  -2.5

# Q22. How do you sort a DataFrame by a specific column?

In [145]:
df.sort_values(by=["pin2", "pin code"], ascending=True)

        name                emailid  pin code sirname  pin2
3  sudhanshu  sskumar9876@gmail.com    560085   kumar  -2.5
2      guddu          abc@gmail.com    123456   kumar  -0.4
1   shashank       shasha@gmail.com    152354  pandit   0.0
0      lalan     rrrlalan@gmail.com    825103   kumar   1.2

# Q23. How do you create a new column in a DataFrame based on the values of another column?

In [147]:
df["Full_Name"] = df["name"] + " " + df["sirname"]
df

        name                emailid  pin code sirname  pin2        Full_Name
0      lalan     rrrlalan@gmail.com    825103   kumar   1.2      lalan kumar
1   shashank       shasha@gmail.com    152354  pandit   0.0  shashank pandit
2      guddu          abc@gmail.com    123456   kumar  -0.4      guddu kumar
3  sudhanshu  sskumar9876@gmail.com    560085   kumar  -2.5  sudhanshu kumar

# Q24. How do you remove duplicates from a DataFrame?

In [153]:
res = df.sort_values(by="sirname", ascending=True)
res.drop_duplicates(subset="sirname", keep="first", inplace=True)
res

       name             emailid  pin code sirname  pin2        Full_Name
0     lalan  rrrlalan@gmail.com    825103   kumar   1.2      lalan kumar
1  shashank    shasha@gmail.com    152354  pandit   0.0  shashank pandit

# Q25. What is the difference between .loc and .iloc in Pandas?

In [169]:
print(df, "\n")
print(df.iloc[2:, 4:], "\n") #We use index number
print(df.loc["0":, "pin2":]) #We use column name and row name

        name                emailid  pin code sirname  pin2        Full_Name
0      lalan     rrrlalan@gmail.com    825103   kumar   1.2      lalan kumar
1   shashank       shasha@gmail.com    152354  pandit   0.0  shashank pandit
2      guddu          abc@gmail.com    123456   kumar  -0.4      guddu kumar
3  sudhanshu  sskumar9876@gmail.com    560085   kumar  -2.5  sudhanshu kumar

   pin2        Full_Name
2  -0.4      guddu kumar
3  -2.5  sudhanshu kumar

   pin2        Full_Name
0   1.2      lalan kumar
1   0.0  shashank pandit
2  -0.4      guddu kumar
3  -2.5  sudhanshu kumar

The loc() function is label based data selecting method which means that we have to pass the name of the row or column which we want to select. This method includes the last element of the range passed in it, unlike iloc(). loc() can accept the boolean data unlike iloc(). Many operations can be performed using the loc() method.

The iloc() function is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. This method does not include the last element of the range passed in it unlike loc(). iloc() does not accept the boolean data unlike loc().